InformationRegisters/бит_КоэффициентыНорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>бит_КоэффициентыНорм</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Коэффициент</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыОбъектовУчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Работы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Норма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/бит_ВидыОбъектовУчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>бит_ВидыОбъектовУчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Здание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛицевойСчет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/бит_Работы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_Работы</Name>
			<Comment>Перечень работ</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОсновнаяЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнаяНормаТруда</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_НормыТруда</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Платная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЕдиницыИзмерения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Основная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/бит_ПодразделенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>бит_ПодразделенияОрганизаций</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Организации</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СокращенноеНаименование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СокращенныеНаименованияПодразделений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УдалитьКонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ВидыКонтактнойИнформацииЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/бит_КоэффициентыНорм/Forms/ФормаЗаписиУправляемая/Ext/Form/Module.bsl
#Область ПроцедурыОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	Если Параметры.Свойство("ЗаполнитьИзСправочникаРаботы") Тогда	
		
		Если Не Параметры.ЗаполнитьИзСправочникаРаботы.Работа = Справочники.бит_Работы.ПустаяСсылка() Тогда
			
		Запись.Период        = Параметры.ЗаполнитьИзСправочникаРаботы.Период;
		Запись.Работа        = Параметры.ЗаполнитьИзСправочникаРаботы.Работа;
		Запись.ЕдиницаИзмерения = ?(Параметры.ЗаполнитьИзСправочникаРаботы.ЕдиницаИзмерения = Справочники.КлассификаторЕдиницИзмерения.ПустаяСсылка(),
							Параметры.ЗаполнитьИзСправочникаРаботы.Работа.ОсновнаяЕдиницаИзмерения, Параметры.ЗаполнитьИзСправочникаРаботы.ЕдиницаИзмерения);
			
		Запись.ВидОбъекта	  =	Перечисления.бит_ВидыОбъектовУчета.Здание;
			
			ВывестиАктуальные(Запись.Работа, Запись.ЕдиницаИзмерения, Запись.ВидОбъекта, Запись.Подразделение);
			
		КонецЕсли;
		
	КонецЕсли;
	
	ТаблицаНормТруда.Сортировать("Норма");
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ТекстСообщения = "Элемент не может быть записан!";
	
	Если НЕ ЗначениеЗаполнено(Запись.Работа) Тогда
		ТекстСообщения = ТекстСообщения + " Не заполнена работа.";
		Отказ = Истина;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Запись.ЕдиницаИзмерения) Тогда
		ТекстСообщения = ТекстСообщения + " Не заполнена единица измерения по работе.";
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.ВидОбъекта) Тогда
		ТекстСообщения  = ТекстСообщения + " Не заполнен вид объекта.";
		Отказ = Истина;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Запись.Подразделение) Тогда
		ТекстСообщения  = ТекстСообщения + " Не заполнено Подразделение.";
		Отказ = Истина;
	КонецЕсли;

	Если Отказ Тогда
		бит_ОбщегоНазначения.СообщитьОбОшибке(ТекстСообщения,Отказ);
	КонецЕсли;
	
	Если Отказ = Ложь Тогда 
		ДобавитьЗаписиНаСервере();
		
		Отказ = Истина;
		ЭтаФорма.Закрыть();	
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ДобавитьЗаписиНаСервере()

	ТЗТаблицаНормТруда = ДанныеФормыВЗначение(ТаблицаНормТруда,Тип("ТаблицаЗначений"));
	
	Для Каждого Строка из ТЗТаблицаНормТруда Цикл
		ДобавитьЗапись(Запись.Период, Запись.Работа, Запись.ЕдиницаИзмерения, Запись.ВидОбъекта, Запись.Подразделение, Строка);
	КонецЦикла;
	
	
КонецПроцедуры

#КонецОбласти

#Область ПрочиеПроцедурыИФункции

// Процедура выводит существующие записи регистра с отбором.
// По услуге, способу расчета, типу и статусу квартиры.
// Или выводит существующие режимы потребеления для услуги, если записей нет.
//
&НаСервере
Процедура ВывестиАктуальные (Работа, ЕдиницаИзмерения, ВидОбъекта, Подразделение)
	
	ТаблицаНормТруда.Очистить();	
	
	ВыборкаНорм = Справочники.бит_НормыТруда.Выбрать(, Работа);
	СписокНорм = Новый СписокЗначений;
	Пока ВыборкаНорм.Следующий() Цикл
		СписокНорм.Добавить(ВыборкаНорм.Ссылка);
	КонецЦикла;
	
	
	Запрос = Новый Запрос;

	Запрос.УстановитьПараметр("Дата"          		 ,Запись.Период);
	Запрос.УстановитьПараметр("Работа"        		 ,Работа);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения"  	 ,ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("ВидОбъекта"   		 ,ВидОбъекта);
	Запрос.УстановитьПараметр("Подразделение"		 ,Подразделение);
	Запрос.УстановитьПараметр("СписокНорм"			 ,СписокНорм);
	Запрос.Текст = "ВЫБРАТЬ
	               |	бит_НормыТруда.Ссылка КАК Норма,
	               |	МАКСИМУМ(бит_КоэффициентыНормСрезПоследних.Коэффициент) КАК Коэффициент
	               |ИЗ
	               |	Справочник.бит_НормыТруда КАК бит_НормыТруда
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_КоэффициентыНорм.СрезПоследних(
	               |				&Дата,
	               |				ЕдиницаИзмерения = &ЕдиницаИзмерения
	               |					И ВидОбъекта = &ВидОбъекта
	               |					И Работа = Работа
	               |					И Подразделение = &Подразделение) КАК бит_КоэффициентыНормСрезПоследних
	               |		ПО бит_НормыТруда.Ссылка = бит_КоэффициентыНормСрезПоследних.Норма
	               |ГДЕ
	               |	бит_НормыТруда.Ссылка В(&СписокНорм)
	               |	И бит_НормыТруда.ЕдиницаИзмерения = &ЕдиницаИзмерения
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	бит_НормыТруда.Ссылка";
	ТаблицаЗаписей = Запрос.Выполнить().Выгрузить();
	
	Если ТаблицаЗаписей.Количество() > 0 Тогда                      
		ТаблицаНормТруда.Загрузить(ТаблицаЗаписей.Скопировать());
	КонецЕсли;
	
	ТаблицаНормТруда.Сортировать("Норма");
	Модифицированность = Ложь;
	
КонецПроцедуры // ВывестиАктуальные()

// Процедура  добавляет записи в регистр.
//
&НаСервере
Процедура ДобавитьЗапись(Период, Работа, ЕдиницаИзмерения, ВидОбъекта, Подразделение, Данные)
	
	НовЗапись                                 = ДанныеФормыВЗначение(Запись,Тип("РегистрСведенийМенеджерЗаписи.бит_КоэффициентыНорм"));

	НовЗапись.Период                          = Период;
	НовЗапись.Работа                          = Работа;
	НовЗапись.ЕдиницаИзмерения		          = ЕдиницаИзмерения;
	НовЗапись.ВидОБъекта                      = ВидОбъекта;
	НовЗапись.Подразделение	                  = Подразделение;
	НовЗапись.Норма				              = Данные.Норма;
	НовЗапись.Коэффициент                     = Данные.Коэффициент;
	НовЗапись.Записать();
	
КонецПроцедуры // ДобавитьЗапись()

&НаКлиенте
Процедура ТаблицаНормТрудаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нормы не могут быть изменены. Они определяются из справочника ""Нормы труда""");
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНормТрудаПередНачаломИзменения(Элемент, Отказ)
	
	Если Элемент.ТекущийЭлемент.Заголовок = "Норма труда" Тогда
		
		Отказ = Истина;

		бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нормы не могут быть изменены. Они определяются из справочника ""Нормы труда""");
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаНормТрудаПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;

	бит_ОбщегоНазначенияКлиентСервер.ВывестиСообщение("Нормы не могут быть изменены. Они определяются из справочника ""Нормы труда""");
	
КонецПроцедуры

&НаКлиенте
Процедура ПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	СписокПодразделений = ПодразделенияНаСервере();
	
	ФормаВыбора = ОткрытьФорму("Справочник.бит_ПодразделенияОрганизаций.Форма.ФормаВыбораУправляемая",,Элемент);
	
	ФормаВыбора.Список.Отбор.Элементы.Очистить();
	
	Эл = ФормаВыбора.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	
	Эл.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Ссылка");
	Эл.ВидСравнения     = ВидСравненияКомпоновкиДанных.ВСписке;
	Эл.ПравоеЗначение   = СписокПодразделений;
	Эл.Использование    = Истина;
	Эл.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	
КонецПроцедуры

&НаСервере
Функция ПодразделенияНаСервере()
	
	СписокПодразделений = Новый СписокЗначений;
	
	Для Каждого ТекСтрока Из Запись.Работа.Подразделения Цикл
		СписокПодразделений.Добавить(ТекСтрока.Подразделение);
	КонецЦикла;
	
	Возврат СписокПодразделений;
	
КонецФункции	

&НаКлиенте
Процедура ПодразделениеПриИзменении(Элемент)
	
	ВывестиАктуальные(Запись.Работа, Запись.ЕдиницаИзмерения, Запись.ВидОбъекта, Запись.Подразделение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// БИТ_ЖКХ 09.09.2016 11:48:47 Начало правки...
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	// БИТ_ЖКХ 09.09.2016 11:48:47 Конец правки.
	
	Оповестить("ОбновитьКоэффициенты",,);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
